---
type: FabricationAncillaryUsage
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# FabricationAncillaryUsage

`Autodesk.Revit.DB.FabricationAncillaryUsage` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | AncillaryDepth | 2017 Subscription Update | `public double AncillaryDepth { get ; }` |
| Property | AncillaryId | 2017 Subscription Update | `public int AncillaryId { get ; }` |
| Property | AncillaryWidthOrDiameter | 2017 Subscription Update | `public double AncillaryWidthOrDiameter { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Length | 2017 Subscription Update | `public double Length { get ; }` |
| Property | ProductCode | 2017 Subscription Update | `public string ProductCode { get ; }` |
| Property | Quantity | 2017 Subscription Update | `public double Quantity { get ; }` |
| Property | Type | 2017 Subscription Update | `public FabricationAncillaryType Type { get ; }` |
| Property | UsageType | 2017 Subscription Update | `public FabricationAncillaryUsageType UsageType { get ; }` |